export const newcomer: {
  [key: string]: {
    reg: RegExp
    msg: string
    ok: string
    err: (msg: string) => string
  }
} = {
  '0': {
    reg: /^\/我的资料$/,
    msg: '/我的资料',
    ok: '成功啦～,你好像还没有物品哦,但你可以使用[/联盟签到]领取每日物品',
    err: (msg: string) => `不对哦～请再次发送[${msg}]`
  },
  '1': {
    reg: /^\/联盟签到$/,
    msg: '/联盟签到',
    ok: '灵石，是新人快速突破的物品之一,快试试[/消耗极品灵石]增加修为',
    err: (msg: string) => `不对哦～请再次发送[${msg}]`
  },
  '2': {
    reg: /^\/消耗极品灵石$/,
    msg: '/消耗极品灵石',
    ok: '突破需要海量的修为,可以开采灵矿获得大量灵石,快试试[/探索灵矿]',
    err: (msg: string) => `不对哦～请再次发送[${msg}]`
  },
  '3': {
    reg: /^\/探索灵矿$/,
    msg: '/探索灵矿',
    ok: '好多灵矿,我们使用[/开采+标记],可消耗掉“开灵铲”',
    err: (msg: string) => `不对哦～请再次发送[${msg}]`
  },
  '4': {
    reg: /^\/开采/,
    msg: '/开采+标记',
    ok: '除了采集灵矿外,击杀怪物的收获更为丰富,试试[/探索怪物]',
    err: (msg: string) => `不对哦～请再次发送[${msg}],例子:/开采124`
  },
  '5': {
    reg: /^\/探索怪物$/,
    msg: '/探索怪物',
    ok: '快看,前方有怪物出现,快使用[/击杀+怪物名]终结它',
    err: (msg: string) => `不对哦～请再次发送[${msg}]`
  },
  '6': {
    reg: /^\/击杀/,
    msg: '/击杀+怪物名',
    ok: '击杀后,会根据不同的怪物等级消耗不同的灵力,此时可以[/打坐]进行恢复。\n当然!修仙世界,危险异常,当[/释放神识]的时候,附近的修士也会浮现。\n可千万不要随意[/偷袭+标记]哦,这片区域归属于天宫,他们可不会让你乱来。\n我们先看看[/修仙地图]吧',
    err: (msg: string) => `不对哦～请再次发送[${msg}]`
  },
  '7': {
    reg: /^\/修仙地图$/,
    msg: '/修仙地图',
    ok: '不同区域之前的修士是不能交互的,不同城市的建筑也有所不同,我们先[/前往极西]看看那边都有什么吧',
    err: (msg: string) => `不对哦～请再次发送[${msg}]`
  },
  '8': {
    reg: /^\/前往极西$/,
    msg: '/前往极西',
    ok: '请耐心等待人物移动,到达计划时间后,可使用[/查看当前位置]了解该区域的更多地点',
    err: (msg: string) => `不对哦～请再次发送[${msg}]`
  },
  '9': {
    reg: /^\/查看当前位置$/,
    msg: '/查看当前位置',
    ok: '万宝楼应该就是可以购买物品的地方,快[/前往万宝楼]看看究竟',
    err: (msg: string) => `不对哦～请再次发送[${msg}]`
  },
  '10': {
    reg: /^\/前往万宝楼$/,
    msg: '/前往万宝楼',
    ok: '一般来说,想要了解它的详细信息,可使用查看+建筑名进行了解,我们试试[/查看万宝楼],看看它都卖些什么吧',
    err: (msg: string) => `不对哦～请再次发送[${msg}]`
  },
  '11': {
    reg: /^\/查看万宝楼$/,
    msg: '/查看万宝楼',
    ok: '[/购买+物品名]需要大量的"下品灵石",提示一下,灵石共分为下中上极品四个品质。\n现在,你需要积累足够修为后进行[/突破 ]成为一名练气修士,才能积攒更多的灵石。\n我们先[/闭关]积累修为吧',
    err: (msg: string) => `不对哦～请再次发送[${msg}]`
  },
  '12': {
    reg: /^\/闭关$/,
    msg: '/闭关',
    ok: '闭关状态下,附近的修士就不会发现你啦,当修炼结束后,记得[/出关]哦。\n嘤嘤,新手指引到这里就结束啦。\n努力成为一名强大的修士吧!\n更多内容,可发送[/修仙帮助]',
    err: (msg: string) => `不对哦～请再次发送[${msg}]`
  }
}
